Revit 2026 API

# InitialColor Class

---

This class is the base class for calculating initial light color.

SystemObject Autodesk.Revit.DB.LightingInitialColor Autodesk.Revit.DB.LightingCustomInitialColor Autodesk.Revit.DB.LightingPresetInitialColor

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class InitialColor : IDisposable
```
```vb
Public Class InitialColor
	Implements IDisposable
```
```cpp
public ref class InitialColor : IDisposable
```
```fsharp
type InitialColor =
    class
        interface IDisposable
    end
```

The InitialColor type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | TemperatureValue | The light color temperature value in Kelvins. |

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Creates a copy of the InitialColor derived object. |
|  | Dispose | Releases all resources used by the InitialColor |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Lighting Namespace